package ru.psu.techjava.services

import ru.psu.techjava.model.CPosition
import ru.psu.techjava.repositories.CRepositoryPosition
import tornadofx.Controller
import java.util.*

class CServicePosition: Controller() {
    private val repositoryPosition: CRepositoryPosition by inject()
    /****************************************************************************************************
     * Запрос списка всех доступных объектов на сервере.                                                *
     ****************************************************************************************************/
    fun getAll()
            = repositoryPosition.getAll()

    /****************************************************************************************************
     * Отправка данных объекта на сервер.                                                               *
     * @param position - объект для отправки.                                                           *
     ****************************************************************************************************/
    fun save(position: CPosition)
            = repositoryPosition.save(position)
    /****************************************************************************************************
     * Отправка всех данных из списка на сервер.                                                        *
     ***************************************************************************************************/
    fun saveAll()
            = repositoryPosition.saveAll()
    /****************************************************************************************************
     * Отправка данных объекта на сервер.                                                               *
     * @param position - объект для отправки.                                                            *
     ***************************************************************************************************/
    fun add(position: CPosition){
        position.id = UUID.randomUUID()
        repositoryPosition.add(position)
    }
    /****************************************************************************************************
     * Отправка данных объекта на сервер.                                                               *
     * @param position - объект для отправки.                                                            *
     ***************************************************************************************************/
    fun delete(position: CPosition)
            = repositoryPosition.delete(position)
}