package ru.psu.techjava.services

import ru.psu.techjava.model.CEmployee
import ru.psu.techjava.repositories.CRepositoryStaff
import tornadofx.*
import java.util.*

/********************************************************************************************************
 * Сервис с логикой для работы со списком сотрудников.                                                  *
 * @author Панин А.Р. 2022 1128.                                                                        *
 ********************************************************************************************************/

class CServiceStaff: Controller() {
    private val repositoryStaff: CRepositoryStaff by inject()
    /****************************************************************************************************
     * Запрос списка всех доступных объектов на сервере.                                                *
     ****************************************************************************************************/
    fun getAll()
        = repositoryStaff.getAll()

    /****************************************************************************************************
    * Отправка всех данных из списка на сервер.                                                        *
    ***************************************************************************************************/
    fun saveAll()
        = repositoryStaff.saveAll()
    /****************************************************************************************************
     * Отправка данных объекта на сервер.                                                               *
     * @param employee - объект для отправки.                                                            *
     ***************************************************************************************************/
    fun add(employee: CEmployee){
        employee.id = UUID.randomUUID()
        repositoryStaff.add(employee)
    }
    /****************************************************************************************************
     * Отправка данных объекта на сервер.                                                               *
     * @param employee - объект для отправки.                                                            *
     ***************************************************************************************************/
    fun delete(employee: CEmployee)
        = repositoryStaff.delete(employee)
}